app/Controllers/MatchController.php

    public function sortMatchGroups()
    {
        $teamsGroup = $this->teamsGroup->join('team', 'team.id=teams_group.team_id')
                ->join('group', 'group.id=teams_group.group_id')
                ->select('group.id as groupId, team.id as teamId')
                ->findAll();
---
SELECT `group`.`id` as `groupId`, `team`.`id` as `teamId`
FROM `teams_group`
JOIN `team` ON `team`.`id`=`teams_group`.`team_id`
JOIN `group` ON `group`.`id`=`teams_group`.`group_id`