app/Controllers/TeamsGroupController.php

    public function get($id = null)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('teams_group tg');

        $builder->select('g.description AS Group, GROUP_CONCAT(t.name ORDER BY t.name ASC SEPARATOR ", ") AS teams, GROUP_CONCAT(t.emblem ORDER BY t.name ASC SEPARATOR ", ") AS images');

        $builder->join('group g', 'tg.group_id = g.id');
        $builder->join('team t', 'tg.team_id = t.id');
        $builder->groupBy('tg.group_id, g.description');

        $query = $builder->get();
---
SELECT `g`.`description` AS `Group`, GROUP_CONCAT(t.name ORDER BY t.name ASC SEPARATOR ", ") AS teams, GROUP_CONCAT(t.emblem ORDER BY t.name ASC SEPARATOR ", ") AS images
FROM `teams_group` `tg`
JOIN `group` `g` ON `tg`.`group_id` = `g`.`id`
JOIN `team` `t` ON `tg`.`team_id` = `t`.`id`
GROUP BY `tg`.`group_id`, `g`.`description`